You need to change it from service_id to service_alias.  I'm afk from my pc
right now but the provider resource definition shows the options

On Fri, 23 Apr 2021, 17:23 JZ, ***@***.***> wrote:

> I just tested 2.55.0 with private_connection_resource_alias but still
> getting the below error. Anybody seeing the same issue?
>
> # module.azml.azurerm_private_endpoint.pe[0] will be created
> + resource "azurerm_private_endpoint" "pe" {
>     + custom_dns_configs       = (known after apply)
>     + id                       = (known after apply)
>     + location                 = "eastus2"
>     + name                     = "[redacted]"
>     + private_dns_zone_configs = (known after apply)
>     + resource_group_name      = "[redacted]"
>     + subnet_id                = "[redacted]"
>
>     + private_service_connection {
>         + is_manual_connection              = false
>         + name                              = "[redacted]"
>         + private_connection_resource_alias = "[redacted].eastus2.azure.privatelinkservice"
>         + private_ip_address                = (known after apply)
>     }
> }
>
> "Property id '[redacted].eastus2.azure.privatelinkservice' at path
> 'properties.privateLinkServiceConnections[0].properties.privateLinkServiceId'
> is invalid. Expect fully qualified resource Id that start with
> '/subscriptions/{subscriptionId}' or
> '/providers/{resourceProviderNamespace}/'."
>
> —
> You are receiving this because you commented.
> Reply to this email directly, view it on GitHub
> <https://github.com/terraform-providers/terraform-provider-azurerm/issues/5556#issuecomment-825770225>,
> or unsubscribe
> <https://github.com/notifications/unsubscribe-auth/AH7GYF5IPXYAYYZ7PUPOM73TKGNGVANCNFSM4KNOCKHQ>
> .
>
